faronov/cc2530-zigbee/tests/test_mac_tx.c
/* SPDX-License-Identifier: BSD-3-Clause
 * Copyright (c) 2026, cc2530-zigbee contributors. See LICENSE.
 * Synthetic source events, never a radio mock or a board fixture.
 */
#include "mac_tx.h"
#include "cc2530_mmio.h"

#include <stddef.h>
#include <string.h>

#define CHECK(c) do { if (!(c)) return (uint16_t)__LINE__; } while (0)
#define CALL(c) do { uint16_t line = (c); if (line != 0u) return line; } while (0)

static const MCU_CODE uint8_t golden[] = {
    0x61, 0x98, 0xa5, 0x34, 0x12, 0x78, 0x56, 0xbc, 0x9a, 0xaa, 0x55, 0xcc
};
static const MCU_CODE uint8_t beacon_request[] = {
    0x03, 0x08, 0xa5, 0xff, 0xff, 0xff, 0xff, 0x07
};
static const MCU_CODE uint8_t data_request[] = {
    0x23, 0x80, 0xa5, 0x34, 0x12, 0xbc, 0x9a, 0x04
};
static const MCU_CODE uint8_t association_short[] = {
    0x23, 0xc8, 0xa5, 0x34, 0x12, 0x78, 0x56, 0xff, 0xff,
    0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x01, 0x88
};
static const MCU_CODE uint8_t association_extended[] = {
    0x23, 0xcc, 0xa5, 0x34, 0x12, 0x18, 0x17, 0x16, 0x15, 0x14, 0x13, 0x12, 0x11,
    0xff, 0xff, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x01, 0x8c
};
static mac_tx_t tx, saved;
static mac_tx_event_t event;
static mac_tx_action_t action, saved_action;
static uint8_t body[125], copy[125], ack[4], length;
static uint32_t now;
static volatile uint8_t i;

static void source(uint8_t kind)
{
    memset(&event, 0, sizeof(event));
    event.kind = kind;
    event.generation = tx.generation;
    event.retry = tx.retries;
    event.nb = tx.nb;
    event.stamp = now;
}

static uint16_t step(void)
{
    CHECK(mac_tx_step(&tx, now, &event, &action) == MAC_TX_OK);
    return 0;
}

static uint16_t poll(void)
{
    CHECK(mac_tx_step(&tx, now, NULL, &action) == MAC_TX_OK);
    return 0;
}

static uint16_t begin(uint8_t ar, uint8_t dsn, uint32_t start,
                      uint32_t lifetime, uint16_t work)
{
    now = start;
    CHECK(mac_tx_init(&tx, dsn, now) == MAC_TX_OK);
    memcpy(body, golden, sizeof(golden));
    if (!ar)
        body[0] &= (uint8_t)~MAC_FLAG_ACK_REQUEST;
    CHECK(mac_tx_submit(&tx, body, sizeof(golden), now, lifetime, work) == MAC_TX_OK);
    CHECK(tx.phase == MAC_TX_DRAW && tx.frame[2] == dsn && tx.next_dsn == (uint8_t)(dsn + 1u));
    CHECK(body[2] == 0xa5);
    return 0;
}

static uint16_t draw(uint8_t random)
{
    CALL(poll());
    CHECK(action.kind == MAC_TX_ACTION_RANDOM && tx.phase == MAC_TX_DRAW_WAIT);
    CALL(poll());
    CHECK(action.kind == MAC_TX_ACTION_NONE);
    source(MAC_TX_EVENT_RANDOM);
    event.value = random;
    CALL(step());
    CHECK(action.kind == MAC_TX_ACTION_ATTEMPT && tx.phase == MAC_TX_RADIO);
    CHECK(action.until == tx.deadline);
    return 0;
}

static uint16_t sent(void)
{
    now = action.at + 36u + 2u * tx.length;
    source(MAC_TX_EVENT_SENT);
    CALL(step());
    CHECK(tx.transmissions == tx.retries + 1u && !tx.uncertain);
    return 0;
}

static uint16_t receive(uint8_t dsn)
{
    ack[0] = 2;
    ack[1] = 0;
    ack[2] = dsn;
    source(MAC_TX_EVENT_ACK);
    event.bytes = ack;
    event.length = 3;
    CALL(step());
    return 0;
}

static uint16_t quiesce(void)
{
    CHECK(tx.phase == MAC_TX_STOPPING && action.kind == MAC_TX_ACTION_QUIESCE);
    CHECK(action.until == now + MAC_TX_STOP_SYMBOLS && action.at == now);
    CHECK(mac_tx_release(&tx) == MAC_TX_STATE);
    CALL(poll());
    CHECK(action.kind == MAC_TX_ACTION_NONE);
    source(MAC_TX_EVENT_QUIESCED);
    CALL(step());
    return 0;
}

static uint16_t initialization(void)
{
    memset(&tx, 0xc7, sizeof(tx));
    saved = tx;
    CHECK(mac_tx_init(NULL, 0x5a, 0x12345678UL) == MAC_TX_INVALID);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    memset(&saved, 0, sizeof(saved));
    saved.next_dsn = 0x5a;
    saved.last = 0x12345678UL;
    saved.ready_at = 0x12345678UL;
    CHECK(mac_tx_init(&tx, 0x5a, 0x12345678UL) == MAC_TX_OK);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    return 0;
}

static uint16_t admission(void)
{
    CALL(begin(1, 0xff, 0, 10000, 100));
    saved = tx;
    CHECK(mac_tx_submit(&tx, body, sizeof(golden), now, 100, 10) == MAC_TX_FULL);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    memset(copy, 0xc7, sizeof(copy));
    length = 0xa5;
    CHECK(mac_tx_copy(&tx, copy, 11, &length) == MAC_TX_SPACE && length == 0xa5);
    for (i = 0; i < sizeof(copy); i++)
        CHECK(copy[i] == 0xc7);
    CHECK(mac_tx_copy(&tx, copy, 12, &length) == MAC_TX_OK && length == 12);
    CHECK(copy[2] == 0xff && memcmp(copy + 3, golden + 3, 9) == 0);
    source(MAC_TX_EVENT_CANCEL);
    CALL(step());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_CANCELLED && !tx.uncertain);
    CHECK(mac_tx_release(&tx) == MAC_TX_OK);
    CHECK(mac_tx_submit(&tx, body, 12, now, 10000, 100) == MAC_TX_OK);
    CHECK(tx.frame[2] == 0 && tx.next_dsn == 1 && tx.generation == 2);
    CHECK(mac_tx_init(&tx, 9, 0) == MAC_TX_OK);
    saved = tx;
    for (i = 0; i < 9; i++) {
        CHECK(mac_tx_submit(&tx, body, i, 0, 100, 10) == MAC_TX_UNSUPPORTED);
        CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    }
    CHECK(mac_tx_submit(&tx, NULL, 12, 0, 100, 10) == MAC_TX_INVALID);
    CHECK(mac_tx_submit(&tx, body, 126, 0, 100, 10) == MAC_TX_UNSUPPORTED);
    CHECK(mac_tx_submit(&tx, body, 12, 0, 0, 10) == MAC_TX_INVALID);
    CHECK(mac_tx_submit(&tx, body, 12, 0, MAC_TX_HALF, 10) == MAC_TX_INVALID);
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 0) == MAC_TX_INVALID);
    CHECK(mac_tx_submit(&tx, body, 12, MAC_TX_HALF, 100, 10) == MAC_TX_INVALID);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    CHECK(mac_tx_submit(&tx, golden, sizeof(golden), 0, 100, 10) == MAC_TX_OK);
    CHECK(tx.frame[2] == 9); /* Generic CODE input on the target. */
    CHECK(mac_tx_init(&tx, 9, 0) == MAC_TX_OK);
    body[0] |= MAC_FLAG_SECURITY;
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 10) == MAC_TX_UNSUPPORTED);
    body[0] = 0x62;
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 10) == MAC_TX_UNSUPPORTED);
    body[0] = 0x71;
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 10) == MAC_TX_UNSUPPORTED);
    memcpy(body, golden, 12);
    body[5] = body[6] = 0xff;
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 10) == MAC_TX_UNSUPPORTED);
    body[0] &= (uint8_t)~MAC_FLAG_ACK_REQUEST;
    CHECK(mac_tx_submit(&tx, body, 125, 0, 10000, 100) == MAC_TX_OK);
    CHECK(mac_tx_copy(&tx, copy, 124, &length) == MAC_TX_SPACE);
    CHECK(mac_tx_copy(&tx, copy, 125, &length) == MAC_TX_OK && length == 125);
    CHECK(mac_tx_init(&tx, 9, 0) == MAC_TX_OK);
    tx.generation = UINT32_MAX; /* Explicit synthetic boundary, compiled on target. */
    saved = tx;
    CHECK(mac_tx_submit(&tx, body, 12, 0, 100, 10) == MAC_TX_GENERATION_EXHAUSTED);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    return 0;
}

