faronov/cc2530-zigbee/tests/test_mac_tx.c
static uint16_t beacon_requests(void)
{
    now = 0;
    CHECK(mac_tx_init(&tx, 0xfe, now) == MAC_TX_OK);
    CHECK(mac_tx_submit(&tx, beacon_request, 8, now, 10000, 100) == MAC_TX_OK);
    CHECK(tx.length == 8 && !tx.ack_requested && tx.frame[2] == 0xfe);
    CHECK(mac_tx_copy(&tx, copy, 8, &length) == MAC_TX_OK && length == 8);
    CHECK(copy[0] == 3 && copy[1] == 8 && memcmp(copy + 3, beacon_request + 3, 5) == 0);
    CALL(draw(0));
    CALL(sent());
    CHECK(tx.phase == MAC_TX_STOPPING && tx.outcome == MAC_TX_UNACKNOWLEDGED);
    CALL(quiesce());
    CHECK(tx.phase == MAC_TX_DONE && tx.transmissions == 1 && tx.retries == 0);
    CHECK(mac_tx_release(&tx) == MAC_TX_OK);
    CHECK(mac_tx_submit(&tx, golden, 12, now, 10000, 100) == MAC_TX_OK);
    CHECK(tx.frame[2] == 0xff && tx.next_dsn == 0);
    CALL(draw(0));
    CHECK(action.at == now + 12u);

    CHECK(mac_tx_init(&tx, 7, 0) == MAC_TX_OK);
    saved = tx;
    memcpy(body, beacon_request, 8);
    body[0] |= MAC_FLAG_PENDING; /* Ignored only by command RX, not allowed on TX. */
    CHECK(mac_tx_submit(&tx, body, 8, 0, 1000, 100) == MAC_TX_UNSUPPORTED);
    CHECK(mac_tx_submit(&tx, data_request, 8, 0, 1000, 100) == MAC_TX_UNSUPPORTED);
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    return 0;
}

static uint16_t success_and_spacing(void)
{
    CALL(begin(1, 0x52, 0xfffffff0UL, 10000, 100));
    CALL(draw(7));
    CHECK(action.at == 124u);
    CALL(sent());
    CHECK(tx.phase == MAC_TX_ACK_WAIT && action.kind == MAC_TX_ACTION_NONE);
    now += 34;
    CALL(receive(0x52));
    CHECK(tx.outcome == MAC_TX_ACKED && tx.phase == MAC_TX_STOPPING);
    CALL(quiesce());
    CHECK(tx.phase == MAC_TX_DONE && tx.transmissions == 1 && !tx.uncertain);
    CHECK(mac_tx_release(&tx) == MAC_TX_OK);
    body[0] &= (uint8_t)~MAC_FLAG_ACK_REQUEST;
    CHECK(mac_tx_submit(&tx, body, 12, now, 10000, 100) == MAC_TX_OK);
    CALL(draw(0));
    CHECK(action.at == now + 12u);
    CALL(sent());
    CHECK(tx.outcome == MAC_TX_UNACKNOWLEDGED);
    CALL(quiesce());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_UNACKNOWLEDGED);
    CHECK(mac_tx_release(&tx) == MAC_TX_OK);
    CHECK(mac_tx_submit(&tx, body, 125, now, 10000, 100) == MAC_TX_OK);
    CALL(draw(0));
    CALL(sent());
    CHECK(tx.ready_at == now + 40u);
    CALL(quiesce());
    return 0;
}

static uint16_t association_requests(void)
{
    now = 0;
    CHECK(mac_tx_init(&tx, 0xff, now) == MAC_TX_OK);
    tx.stop_steps = 0xc7; /* Synthetic reset-span boundary, never a radio reset. */
    CHECK(mac_tx_submit(&tx, association_short, 19, now, 10000, 100) == MAC_TX_OK);
    CHECK(tx.ack_requested && tx.frame[2] == 0xff && tx.stop_steps == 0xc7);
    CHECK(mac_tx_copy(&tx, copy, 19, &length) == MAC_TX_OK && length == 19);
    copy[2] = 0xa5;
    CHECK(memcmp(copy, association_short, 19) == 0);
    copy[2] = 0xff;
    for (i = 0; i < 4; i++) {
        CALL(draw(0));
        CALL(sent());
        now += i == 3 ? 34u : MAC_TX_ACK_SYMBOLS;
        if (i == 3)
            CALL(receive(0xff));
        else
            CALL(poll());
        CHECK(tx.retries == i && memcmp(tx.frame, copy, 19) == 0);
        CALL(quiesce());
    }
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_ACKED
          && tx.transmissions == 4 && tx.ready_at == now + 40u);
    CHECK(mac_tx_release(&tx) == MAC_TX_OK);
    length = tx.stop_steps;
    memcpy(body, association_extended, 25);
    CHECK(mac_tx_submit(&tx, body, 25, now, 10000, 100) == MAC_TX_OK);
    CHECK(tx.frame[2] == 0 && tx.next_dsn == 1 && tx.generation == 2
          && tx.stop_steps == length);
    CALL(draw(0));
    CHECK(action.at == now + 40u);
    source(MAC_TX_EVENT_FAILURE);
    CALL(step());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_ADAPTER_ERROR && tx.uncertain);
    CHECK(mac_tx_release(&tx) == MAC_TX_STATE);
    return 0;
}

static uint16_t backoff_retry(void)
{
    CALL(begin(1, 0x31, 0, 100000, 500));
    for (i = 0; i < 5; i++) {
        CALL(draw(0xff));
        CHECK(action.at == now + (i == 0 ? 140u : i == 1 ? 300u : 620u));
        now = action.at + 8u;
        source(MAC_TX_EVENT_BUSY);
        CALL(step());
        CHECK(tx.nb == i + 1u && tx.transmissions == 0 && !tx.uncertain);
    }
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_CHANNEL_ACCESS);
    CALL(begin(1, 0x32, 0, 100000, 500));
    for (i = 0; i < 4; i++) {
        CHECK(tx.nb == 0 && tx.be == 3 && tx.retries == i);
        CALL(draw(0));
        CALL(sent());
        now += MAC_TX_ACK_SYMBOLS;
        CALL(poll());
        CHECK(tx.outcome == MAC_TX_NO_ACK && tx.frame[2] == 0x32);
        CALL(quiesce());
        CHECK(tx.phase == (i == 3 ? MAC_TX_DONE : MAC_TX_DRAW));
    }
    CHECK(tx.transmissions == 4 && tx.retries == 3 && tx.outcome == MAC_TX_NO_ACK);
    return 0;
}

static uint16_t ack_edges(void)
{
    CALL(begin(1, 0x44, 10, 10000, 100));
    CALL(draw(0));
    CALL(sent());
    now += 34;
    source(MAC_TX_EVENT_ACK);
    ack[0] = 0xfa; /* Pending and all other low ACK FCF bits; ignored on RX. */
    ack[1] = 0xff;
    ack[2] = 0x44;
    event.bytes = ack;
    for (i = 0; i <= 4; i++) {
        if (i == 3)
            continue;
        event.length = i;
        CALL(step());
        CHECK(tx.phase == MAC_TX_ACK_WAIT);
    }
    event.length = 3;
    event.generation++;
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.generation--;
    event.nb++;
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.nb--;
    event.retry++;
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.retry--;
    event.stamp--;
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.stamp = now;
    CALL(step());
    CHECK(tx.outcome == MAC_TX_ACKED && tx.pending == 1);
    CALL(quiesce());
    saved = tx;
    CALL(step()); /* duplicate QUIESCED after DONE cannot complete twice */
    CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
    CALL(begin(1, 0x44, 0, 10000, 100));
    CALL(draw(0));
    CALL(sent());
    now += 34;
    CALL(receive(0x45)); /* Wrong DSN fails this attempt, not success or rebind. */
    CHECK(tx.outcome == MAC_TX_NO_ACK && tx.retry_pending == 1);
    CALL(quiesce());
    CALL(draw(0));
    CHECK(action.at == tx.tx_end + MAC_TX_ACK_SYMBOLS + 12u);
    source(MAC_TX_EVENT_ACK); /* Old ACK during a new CCA/TX action. */
    event.bytes = ack;
    event.length = 3;
    CALL(step());
    CHECK(tx.phase == MAC_TX_RADIO);
    CALL(sent());
    now += MAC_TX_ACK_SYMBOLS;
    CALL(receive(0x44)); /* Completion exactly at the boundary, before timeout. */
    CHECK(tx.outcome == MAC_TX_ACKED);
    CALL(quiesce());
    CALL(begin(1, 0x44, 0, 10000, 100));
    CALL(draw(0));
    CALL(sent());
    now += MAC_TX_ACK_SYMBOLS + 1u;
    CALL(receive(0x44));
    CHECK(tx.outcome == MAC_TX_NO_ACK && tx.phase == MAC_TX_STOPPING);
    return 0;
}

static uint16_t cancellation_and_faults(void)
{
    for (i = 0; i < 3; i++) {
        CALL(begin(1, 1, 0, 10000, 100));
        if (i != 0)
            CALL(draw(0));
        if (i == 2)
            CALL(sent());
        source(MAC_TX_EVENT_CANCEL);
        CALL(step());
        CHECK(tx.outcome == MAC_TX_CANCELLED);
        if (i != 0)
            CALL(quiesce());
        CHECK(tx.phase == MAC_TX_DONE && tx.uncertain == (i == 1));
        if (i == 1)
            CHECK(tx.ready_at == now + MAC_TX_ACK_SYMBOLS + 12u);
        if (i == 2)
            CHECK(tx.ready_at == tx.tx_end + MAC_TX_ACK_SYMBOLS + 12u);
    }
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    source(MAC_TX_EVENT_FAILURE);
    CALL(step());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_ADAPTER_ERROR && tx.uncertain);
    saved = tx;
    CALL(poll());
    CHECK(memcmp(&tx, &saved, sizeof(tx)) == 0);
    CHECK(mac_tx_release(&tx) == MAC_TX_STATE);
    CHECK(mac_tx_submit(&tx, body, 12, now, 1000, 10) == MAC_TX_FULL);
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    source(MAC_TX_EVENT_SENT); /* Cannot complete before the scheduled frame. */
    CALL(step());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_ADAPTER_ERROR);
    for (i = 0; i < 2; i++) {
        CALL(begin(1, 1, 20, 10000, 100));
        now += i == 0 ? UINT32_MAX : MAC_TX_HALF;
        CALL(poll());
        CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_CLOCK_ERROR);
    }
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    source(MAC_TX_EVENT_CANCEL);
    CALL(step());
    for (i = 0; i < MAC_TX_STOP_STEPS + 1u; i++)
        CALL(poll());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_STOP_FAILED && tx.uncertain);
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    source(MAC_TX_EVENT_CANCEL);
    CALL(step());
    now += MAC_TX_STOP_SYMBOLS;
    source(MAC_TX_EVENT_QUIESCED);
    CALL(step());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_STOP_FAILED);
    return 0;
}

static uint16_t lifetimes_and_errors(void)
{
    CALL(begin(1, 1, 0, 100, 1));
    CALL(poll());
    CALL(poll());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_WORK_LIMIT);
    CALL(begin(1, 1, 0xfffffff0UL, 100, 100));
    now += 100;
    CALL(poll());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_LIFETIME);
    CALL(begin(1, 1, 0, 10, 100));
    CALL(poll());
    source(MAC_TX_EVENT_RANDOM);
    event.value = 1;
    CALL(step());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_LIFETIME);
    CALL(begin(1, 1, 0, 100, 100));
    CALL(draw(0));
    now = 100;
    CALL(poll());
    CHECK(tx.outcome == MAC_TX_LIFETIME && tx.uncertain);
    CALL(quiesce());
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    CALL(sent());
    now += MAC_TX_ACK_SYMBOLS;
    CALL(poll());
    now = tx.deadline;
    source(MAC_TX_EVENT_QUIESCED);
    CALL(step());
    CHECK(tx.phase == MAC_TX_FAULT && tx.outcome == MAC_TX_STOP_FAILED);
    CALL(begin(1, 1, 0, 120, 100));
    CALL(draw(0));
    CALL(sent());
    now += MAC_TX_ACK_SYMBOLS;
    CALL(poll());
    now = 120;
    source(MAC_TX_EVENT_QUIESCED);
    CALL(step());
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_LIFETIME);
    CALL(begin(1, 1, 0, 1000, 100));
    saved = tx;
    memset(&action, 0xc7, sizeof(action));
    saved_action = action;
    source(0xff);
    CHECK(mac_tx_step(&tx, now, &event, &action) == MAC_TX_INVALID);
    source(MAC_TX_EVENT_ACK);
    event.length = 3;
    CHECK(mac_tx_step(&tx, now, &event, &action) == MAC_TX_INVALID);
    CHECK(mac_tx_step(&tx, now, NULL, NULL) == MAC_TX_INVALID);
    CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
    CHECK(memcmp(&saved_action, &action, sizeof(action)) == 0);
    return 0;
}

