faronov/cc2530-zigbee/tests/test_mac_tx.c
#ifdef CC2530_HOST_TEST
static uint16_t self_test(void)
#else
volatile __xdata __at(0x1e00) uint8_t mac_tx_result[8];

void main(void)
#endif
{
    uint16_t result = initialization();
    if (!result)
        result = admission();
    if (!result)
        result = beacon_requests();
    if (!result)
        result = association_requests();
    if (!result)
        result = success_and_spacing();
    if (!result)
        result = backoff_retry();
    if (!result)
        result = ack_edges();
    if (!result)
        result = cancellation_and_faults();
    if (!result)
        result = lifetimes_and_errors();
#ifdef CC2530_HOST_TEST
    return result;
#else
    mac_tx_result[0] = 'M';
    mac_tx_result[1] = 'T';
    mac_tx_result[2] = 'X';
    mac_tx_result[3] = '1';
    mac_tx_result[4] = 1;
    mac_tx_result[5] = 8;
    mac_tx_result[6] = (uint8_t)result;
    mac_tx_result[7] = (uint8_t)(result >> 8);
    __asm
        .globl _mac_tx_done
    _mac_tx_done:
        nop
    __endasm;
    for (;;) {}
#endif
}

#ifdef CC2530_HOST_TEST
#include <stdio.h>
#include <stdlib.h>

static uint16_t exhaustive(void)
{
    uint32_t fcf;
    unsigned n, j;
    uint8_t *exact;
    mac_header_t header;
    mac_frame_info_t decoded;

    CHECK(mac_frame_decode(data_request, sizeof(data_request), &decoded) == MAC_CODEC_OK);
    CHECK(decoded.header.type == MAC_FRAME_COMMAND);
    for (fcf = 2; fcf <= 0xffffu; fcf += 8) {
        CALL(begin(1, 0x5a, 0, 10000, 100));
        CALL(draw(0));
        CALL(sent());
        now += 34;
        ack[0] = (uint8_t)fcf;
        ack[1] = (uint8_t)(fcf >> 8);
        ack[2] = 0x5a;
        source(MAC_TX_EVENT_ACK);
        event.bytes = ack;
        event.length = 3;
        CALL(step());
        CHECK(tx.outcome == MAC_TX_ACKED && tx.pending == ((fcf & 0x10u) != 0u));
    }
    for (n = 0; n <= 255; n++) {
        CALL(begin(1, (uint8_t)n, 0, 10000, 100));
        CALL(draw((uint8_t)n));
        CHECK(action.at == (uint32_t)(n & 7u) * 20u);
        CALL(sent());
        now += 34;
        CALL(receive((uint8_t)n));
        CHECK(tx.outcome == MAC_TX_ACKED);
    }
    for (n = 0; n <= 126; n++) {
        exact = malloc(n ? n : 1);
        CHECK(exact != NULL);
        memset(exact, 0xc7, n);
        CALL(begin(1, 1, 0, 10000, 100));
        length = 0xa5;
        CHECK(mac_tx_copy(&tx, exact, (uint16_t)n, &length)
              == (n < 12 ? MAC_TX_SPACE : MAC_TX_OK));
        if (n < 12) {
            CHECK(length == 0xa5);
            for (j = 0; j < n; j++)
                CHECK(exact[j] == 0xc7);
        }
        free(exact);
    }
    for (n = 0; n <= 126; n++) {
        exact = malloc(n ? n : 1);
        CHECK(exact != NULL);
        memset(exact, 0x69, n);
        memcpy(exact, golden, n < sizeof(golden) ? n : sizeof(golden));
        CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
        saved = tx;
        CHECK(mac_tx_submit(&tx, exact, (uint16_t)n, 0, 10000, 100)
              == (n < 9 || n > 125 ? MAC_TX_UNSUPPORTED : MAC_TX_OK));
        if (n < 9 || n > 125)
            CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
        memset(exact, 0x69, n);
        memcpy(exact, beacon_request, n < sizeof(beacon_request) ? n : sizeof(beacon_request));
        CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
        saved = tx;
        CHECK(mac_tx_submit(&tx, exact, (uint16_t)n, 0, 10000, 100)
              == (n == sizeof(beacon_request) ? MAC_TX_OK : MAC_TX_UNSUPPORTED));
        if (n != sizeof(beacon_request))
            CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
        free(exact);
    }
    for (j = 0; j < sizeof(beacon_request); j++) {
        for (n = 0; n <= 255; n++) {
            memcpy(body, beacon_request, sizeof(beacon_request));
            body[j] = (uint8_t)n;
            CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
            saved = tx;
            CHECK(mac_tx_submit(&tx, body, sizeof(beacon_request), 0, 10000, 100)
                  == (j == 2 || n == beacon_request[j] ? MAC_TX_OK : MAC_TX_UNSUPPORTED));
            if (j != 2 && n != beacon_request[j])
                CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
        }
    }
    now = 0;
    CHECK(mac_tx_init(&tx, 0x5a, now) == MAC_TX_OK);
    CHECK(mac_tx_submit(&tx, beacon_request, 8, now, 10000, 100) == MAC_TX_OK);
    for (n = 0; n < 5; n++) {
        CALL(draw(0));
        now = action.at + 8u;
        source(MAC_TX_EVENT_BUSY);
        CALL(step());
    }
    CHECK(tx.phase == MAC_TX_DONE && tx.outcome == MAC_TX_CHANNEL_ACCESS);
    CHECK(tx.transmissions == 0 && tx.retries == 0 && !tx.uncertain);
    for (n = 0; n <= 4; n++) {
        exact = malloc(n ? n : 1);
        CHECK(exact != NULL);
        memset(exact, 0, n);
        if (n != 0)
            exact[0] = 2;
        if (n >= 3)
            exact[2] = 1;
        CALL(begin(1, 1, 0, 10000, 100));
        CALL(draw(0));
        CALL(sent());
        now += 34;
        source(MAC_TX_EVENT_ACK);
        event.bytes = exact;
        event.length = (uint16_t)n;
        CALL(step());
        CHECK(tx.phase == (n == 3 ? MAC_TX_STOPPING : MAC_TX_ACK_WAIT));
        free(exact);
    }
    /* Reuse the real encoder for every admitted DATA address/version/PAN/AR
     * combination; mismatched canonical compression remains a TX rejection.
     */
    for (n = 0; n < 32; n++) {
        memset(&header, 0, sizeof(header));
        header.type = MAC_FRAME_DATA;
        header.version = (uint8_t)(n & 1u);
        header.destination_mode = (n & 2u) ? MAC_ADDRESS_EXTENDED : MAC_ADDRESS_SHORT;
        header.source_mode = (n & 4u) ? MAC_ADDRESS_EXTENDED : MAC_ADDRESS_SHORT;
        header.source_pan = 0x1234;
        header.destination_pan = (n & 8u) ? 0x2345 : 0x1234;
        header.flags = (n & 8u) ? 0 : MAC_FLAG_PAN_COMPRESSION;
        if (n & 16u)
            header.flags |= MAC_FLAG_ACK_REQUEST;
        memset(header.source, 0x31, sizeof(header.source));
        memset(header.destination, 0x42, sizeof(header.destination));
        CHECK(mac_frame_encode(&header, NULL, 0, body, 125, &length) == MAC_CODEC_OK);
        CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
        CHECK(mac_tx_submit(&tx, body, length, 0, 10000, 100) == MAC_TX_OK);
        CHECK(tx.frame[2] == 0x5a && tx.length == length);
        CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
        header.flags &= (uint8_t)~MAC_FLAG_PAN_COMPRESSION;
        header.destination_pan = header.source_pan;
        CHECK(mac_frame_encode(&header, NULL, 0, body, 125, &length) == MAC_CODEC_OK);
        CHECK(mac_tx_submit(&tx, body, length, 0, 10000, 100) == MAC_TX_UNSUPPORTED);
    }
    CALL(begin(1, 1, 0, 10000, 100));
    CALL(draw(0));
    CALL(sent());
    now += 34;
    source(MAC_TX_EVENT_ACK);
    ack[0] = 2;
    ack[1] = 0;
    ack[2] = 1;
    event.bytes = ack;
    event.length = 3;
    event.stamp = now + 1u; /* Future and pre-transmission stamps do not match. */
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.stamp = tx.tx_end;
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    event.stamp = now;
    ack[0] = 1; /* A DATA frame is not an ACK, even with matching DSN. */
    CALL(step());
    CHECK(tx.phase == MAC_TX_ACK_WAIT);
    ack[0] = 2;
    CALL(step());
    CHECK(tx.outcome == MAC_TX_ACKED);
    return 0;
}

/* Explicit identifier-based reference with separate command branches and
 * capability indexing. Syntax still goes through the unchanged real codec.
 */
static mac_tx_result_t admission_reference(const uint8_t *bytes, uint16_t size)
{
    mac_frame_info_t decoded;
    const mac_header_t *h = &decoded.header;

    if (mac_frame_decode(bytes, size, &decoded) != MAC_CODEC_OK
            || (h->flags & MAC_FLAG_PENDING))
        return MAC_TX_UNSUPPORTED;
    if (h->type == MAC_FRAME_COMMAND) {
        if (bytes[decoded.payload_offset] == MAC_COMMAND_BEACON_REQUEST)
            return MAC_TX_OK;
        if (bytes[decoded.payload_offset] == MAC_COMMAND_ASSOCIATION_REQUEST
                && h->destination_pan != 0xffffu
                && (bytes[decoded.payload_offset + 1] == 0x88
                    || bytes[decoded.payload_offset + 1] == 0x8c))
            return MAC_TX_OK;
        return MAC_TX_UNSUPPORTED;
    }
    if (h->type != MAC_FRAME_DATA || h->source_pan == 0xffffu || h->destination_pan == 0xffffu
            || (!(h->flags & MAC_FLAG_PAN_COMPRESSION) && h->source_pan == h->destination_pan)
            || (h->source_mode == MAC_ADDRESS_SHORT && h->source[0] == 0xfe && h->source[1] == 0xff)
            || (h->destination_mode == MAC_ADDRESS_SHORT
                && h->destination[0] == 0xfe && h->destination[1] == 0xff))
        return MAC_TX_UNSUPPORTED;
    return MAC_TX_OK;
}

static uint16_t exact_admission(const uint8_t *bytes, unsigned size, mac_tx_result_t expected)
{
    uint8_t *exact = malloc(size ? size : 1);
    CHECK(exact != NULL);
    memcpy(exact, bytes, size);
    CHECK(mac_tx_init(&tx, 0x5a, 0) == MAC_TX_OK);
    saved = tx;
    CHECK(mac_tx_submit(&tx, exact, (uint16_t)size, 0, 10000, 100) == expected);
    CHECK(memcmp(exact, bytes, size) == 0);
    if (expected == MAC_TX_OK) {
        CHECK(tx.frame[2] == 0x5a && tx.next_dsn == 0x5b && tx.generation == 1);
        CHECK(tx.length == size && memcmp(tx.frame, bytes, 2) == 0
              && memcmp(tx.frame + 3, bytes + 3, size - 3) == 0);
    } else {
        CHECK(memcmp(&saved, &tx, sizeof(tx)) == 0);
    }
    free(exact);
    return 0;
}

